[
  {
    "rank": 151,
    "player_name": "MarShawn Lloyd",
    "team": "Green Bay Packers",
    "position": "RB",
    "status": null,
    "statistics_2024": {
      "CAR": 6,
      "YDS": 15,
      "AVG": 2.5,
      "TD": 0,
      "REC": 1,
      "REC_YDS": 3,
      "REC_TD": 0,
      "FPTS": 2.8
    },
    "projections_2025": {
      "CAR": 62,
      "YDS": 260,
      "AVG": 4.2,
      "TD": 2,
      "REC": 20,
      "REC_YDS": 143,
      "REC_TD": 1,
      "FPTS": 76.35
    },
    "outlook_2025": "Lloyd is entering his second NFL season after being limited to one game during his rookie season. The 2024 third-round pick produced 18 yards on seven touches while playing 10 snaps in Week 2. Ankle and hamstring injuries then knocked him out for a few months and appendicitis ended any chance of a return. The 24-year-old may be the future lead back in Green Bay, but he'll begin his second season as the favorite for backup/change-of-pace duties behind feature back Josh Jacobs. The role is unlikely to lead to standalone value, but there's plenty of insurance appeal here in an offense that allowed Jacobs 337 touches (fifth most) last season. Lloyd is a fine late-round dart throw."
  },
  {
    "rank": 152,
    "player_name": "Jack Bech",
    "team": "Las Vegas Raiders",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": null,
      "REC": null,
      "YDS": null,
      "AVG": null,
      "TD": null,
      "CAR": null,
      "RUSH_YDS": null,
      "RUSH_TD": null,
      "FPTS": null
    },
    "projections_2025": {
      "TAR": 69,
      "REC": 45,
      "YDS": 583,
      "AVG": 13.1,
      "TD": 3,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 119.73
    },
    "outlook_2025": "Bech was selected by Las Vegas in the second round of April's draft. He was used sparingly for much of his first three collegiate seasons prior to busting out with a 62-1,034-9 showing in 2024. He can align all over the formation and figures to do most of his damage in the short-to-intermediate range. With only Jakobi Meyers and Brock Bowers clearly ahead of him for targets, Bech has a path to a sizable 2025 role in an offense now led by Geno Smith. The TCU product is well worth a mid-to-late-round flier on draft day."
  },
  {
    "rank": 153,
    "player_name": "Wan'Dale Robinson",
    "team": "New York Giants",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": 140,
      "REC": 93,
      "YDS": 699,
      "AVG": 7.5,
      "TD": 3,
      "CAR": 3,
      "RUSH_YDS": 18,
      "RUSH_TD": 0,
      "FPTS": 182.7
    },
    "projections_2025": {
      "TAR": 100,
      "REC": 69,
      "YDS": 675,
      "AVG": 9.8,
      "TD": 2,
      "CAR": 2,
      "RUSH_YDS": 13,
      "RUSH_TD": 0,
      "FPTS": 152.1
    },
    "outlook_2025": "Robinson is entering his fourth NFL season following a breakout 2024 campaign. The 2022 second-round pick was limited to 838 yards and three TDs on 94 touches during his first two seasons (21 games), but made the leap to 717 yards and three TDs on 96 touches in 17 games while playing alongside Malik Nabers in 2024. Despite handling a hefty 25% target share (which helped him to top-10 finishes in both targets and receptions), Robinson finished outside the top 40 receivers in yardage and fantasy PPG due to a WR-low 4.9 aDOT and horrific 5.0 YPT. The 24-year-old is strictly a short-area option and, though having Russell Wilson (and perhaps Jaxson Dart) under center will help, Robinson is a very low-ceiling PPR depth receiver."
  },
  {
    "rank": 154,
    "player_name": "Marvin Mims Jr.",
    "team": "Denver Broncos",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": 52,
      "REC": 39,
      "YDS": 503,
      "AVG": 12.9,
      "TD": 6,
      "CAR": 13,
      "RUSH_YDS": 42,
      "RUSH_TD": 0,
      "FPTS": 129.5
    },
    "projections_2025": {
      "TAR": 65,
      "REC": 44,
      "YDS": 627,
      "AVG": 14.4,
      "TD": 4,
      "CAR": 22,
      "RUSH_YDS": 108,
      "RUSH_TD": 1,
      "FPTS": 149.62
    },
    "outlook_2025": "Mims is entering his third NFL season with breakout potential after a red-hot finish to 2024. After barely seeing work his first year and a half in the league (1.6 touches per game), the 2023 second-round pick handled 12 carries and 37 targets during Weeks 10-18 (eight games). He scored six TDs and averaged 13.0 fantasy PPG, which included three games with 19-plus points in his final five outings. On the negative side, Mims remained a part-time player during his heater, failing to play more than 48% of the offensive snaps in any game prior to hitting a career-high 69% in the playoff loss to Buffalo. With Courtland Sutton the only receiver clearly ahead of him on the depth chart in Denver, Mims is positioned for a Year 3 leap. He's a fine late-round lottery ticket."
  },
  {
    "rank": 155,
    "player_name": "Kyle Williams",
    "team": "New England Patriots",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": null,
      "REC": null,
      "YDS": null,
      "AVG": null,
      "TD": null,
      "CAR": null,
      "RUSH_YDS": null,
      "RUSH_TD": null,
      "FPTS": null
    },
    "projections_2025": {
      "TAR": 56,
      "REC": 35,
      "YDS": 439,
      "AVG": 12.4,
      "TD": 3,
      "CAR": 2,
      "RUSH_YDS": 14,
      "RUSH_TD": 0,
      "FPTS": 96.87
    },
    "outlook_2025": "Williams was selected by New England in the third round of April's draft. He is an undersized receiver (5-foot-10, 190 pounds) who soaked up a ton of work in college, totaling a 248-3,608-29 receiving line. When active, he handled 25% of the targets and 31% of the air yards during his five collegiate seasons. Drops were an issue, but he used his speed to produce well after the catch (6.4 RAC). There are a lot of bodies in the Patriots' WR room, but with Stefon Diggs (31 and recovering from a torn ACL), DeMario Douglas, Kayshon Boutte and Mack Hollins among the top competition, Williams easily could lead this group if he proves to be the real deal. The 22-year-old is a solid late-round lottery ticket."
  },
  {
    "rank": 156,
    "player_name": "Rashod Bateman",
    "team": "Baltimore Ravens",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": 72,
      "REC": 45,
      "YDS": 756,
      "AVG": 16.8,
      "TD": 9,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 174.6
    },
    "projections_2025": {
      "TAR": 68,
      "REC": 43,
      "YDS": 611,
      "AVG": 14.2,
      "TD": 5,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 133.49
    },
    "outlook_2025": "Bateman is entering his fifth season (all with Baltimore) following a big leap forward in 2024. Bateman appeared in all 17 regular season games for the first time and, though his 15.4% target share was the second lowest of his career, he posted career-best marks in yardage, touchdowns and fantasy points. Targets remained inconsistent, however, and led to extremely boom/bust production (eight single-digit fantasy point games and a 47th-place finish in PPG, the latter of which is a career best). The 25-year-old is a capable situational deep threat (he's ranked top 12 in aDOT two years in a row), but he's a good bet for touchdown regression to the mean (4.6 expected TDs last season) and his usage is too volatile to allow weekly flex consideration."
  },
  {
    "rank": 157,
    "player_name": "Luther Burden III",
    "team": "Chicago Bears",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": null,
      "REC": null,
      "YDS": null,
      "AVG": null,
      "TD": null,
      "CAR": null,
      "RUSH_YDS": null,
      "RUSH_TD": null,
      "FPTS": null
    },
    "projections_2025": {
      "TAR": 66,
      "REC": 43,
      "YDS": 502,
      "AVG": 11.8,
      "TD": 3,
      "CAR": 4,
      "RUSH_YDS": 26,
      "RUSH_TD": 0,
      "FPTS": 116.37
    },
    "outlook_2025": "Burden was selected by Chicago in the second round of April's draft. He is a bit undersized (his 8.5-inch hands tied for smallest in this class), but he's very young (21) and was highly relied upon and productive during three seasons at Missouri. He's fast with terrific playmaking ability and can align all over the formation. Burden is set to replace Keenan Allen as Chicago's slot man, but there are a lot of mouths to feed in an offense that also includes DJ Moore, Rome Odunze and Colston Loveland. Consistent Year 1 fantasy production is unlikely, so Burden is only worth a late flier."
  },
  {
    "rank": 158,
    "player_name": "Jalen McMillan",
    "team": "Tampa Bay Buccaneers",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": 58,
      "REC": 37,
      "YDS": 461,
      "AVG": 12.5,
      "TD": 8,
      "CAR": 4,
      "RUSH_YDS": 43,
      "RUSH_TD": 0,
      "FPTS": 135.4
    },
    "projections_2025": {
      "TAR": 51,
      "REC": 32,
      "YDS": 409,
      "AVG": 12.8,
      "TD": 4,
      "CAR": 3,
      "RUSH_YDS": 18,
      "RUSH_TD": 0,
      "FPTS": 96.32
    },
    "outlook_2025": "McMillan enters his second NFL season as a bit of a tricky evaluation. The 2024 third-round pick opened his rookie season as a de facto full-time player, but was rarely targeted behind Mike Evans and Chris Godwin. He was finally featured during the final five regular-season games and exploded for a league-high seven TD catches (at least one in all five outings) and 19.8 fantasy PPG (at least 16.7 points in all five). Of course, Godwin was out during that stretch and, even if he misses some time in 2025, the team drafted Emeka Egbuka in the first round of April's draft. Consistent fantasy production will be hard for McMillan to find with Evans, Godwin and Egbuka in the mix, so he'll be only a deep-league flex option if Godwin is sidelined. McMillan is only worth a late-round flier."
  },
  {
    "rank": 159,
    "player_name": "Tre Harris",
    "team": "Los Angeles Chargers",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": null,
      "REC": null,
      "YDS": null,
      "AVG": null,
      "TD": null,
      "CAR": null,
      "RUSH_YDS": null,
      "RUSH_TD": null,
      "FPTS": null
    },
    "projections_2025": {
      "TAR": 61,
      "REC": 39,
      "YDS": 502,
      "AVG": 13.0,
      "TD": 3,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 107.48
    },
    "outlook_2025": "Harris was selected by the Chargers in the second round of April's draft. He is a tall, fast, perimeter WR whose absurd 5.20 YPRR last season was more than a yard higher than any other WR in this class. His 3.04 career mark also topped this class and came on a hefty 1,164 routes across 51 games. Harris' path to rookie-season work is tricky. While he easily could emerge as the team's top perimeter receiver, he could also begin his career behind behind Keenan Allen, Quentin Johnston and slot Ladd McConkey in target priority. Harris is a fine late-round flier, but has work to do in order to become a weekly fantasy starter."
  },
  {
    "rank": 160,
    "player_name": "Ray Davis",
    "team": "Buffalo Bills",
    "position": "RB",
    "status": null,
    "statistics_2024": {
      "CAR": 113,
      "YDS": 442,
      "AVG": 3.9,
      "TD": 3,
      "REC": 17,
      "REC_YDS": 189,
      "REC_TD": 3,
      "FPTS": 116.1
    },
    "projections_2025": {
      "CAR": 106,
      "YDS": 440,
      "AVG": 4.2,
      "TD": 3,
      "REC": 8,
      "REC_YDS": 57,
      "REC_TD": 0,
      "FPTS": 81.11
    },
    "outlook_2025": "Davis is entering his second season after soaking up 130 touches as a rookie last season. The fourth-round pick essentially split change-of-pace duties with Ty Johnson behind lead back James Cook. Davis played 24% of the snaps on the season and averaged 7.6 touches per game. He cleared 12 touches only twice (Cook was out or limited for both) and was impressive (152 yards in Week 6, 65 yards and one TD in Week 18). The 25-year-old was effective as both a rusher and receiver and, as we saw in a small sample last season, he'd likely be Buffalo's lead back (with Johnson also plenty involved) in the event of a Cook injury. That makes him a valuable insurance back worth consideration in the late rounds."
  },
  {
    "rank": 161,
    "player_name": "Roschon Johnson",
    "team": "Chicago Bears",
    "position": "RB",
    "status": "Questionable",
    "statistics_2024": {
      "CAR": 55,
      "YDS": 150,
      "AVG": 2.7,
      "TD": 6,
      "REC": 16,
      "REC_YDS": 104,
      "REC_TD": 0,
      "FPTS": 77.4
    },
    "projections_2025": {
      "CAR": 91,
      "YDS": 372,
      "AVG": 4.1,
      "TD": 5,
      "REC": 21,
      "REC_YDS": 132,
      "REC_TD": 1,
      "FPTS": 104.02
    },
    "outlook_2025": "Johnson is entering his third NFL season having racked up 186 touches in 29 games during his first two seasons. The 2023 fourth-round pick impressed, especially as a receiver, in a limited rookie-season role (115 touches), but with D'Andre Swift brought in as lead back in 2024, Johnson dripped to 71 touches. That wasn't enough to allow consistent fantasy value, but he was busy near the goal line, matching Swift's six TDs and eight carries inside the 5 yard line. The 25-year-old enters 2025 well positioned as Swift's primary backup, with special teamer Travis Homer as his primary competition. Johnson has some late-round insurance appeal."
  },
  {
    "rank": 162,
    "player_name": "Will Shipley",
    "team": "Philadelphia Eagles",
    "position": "RB",
    "status": null,
    "statistics_2024": {
      "CAR": 30,
      "YDS": 82,
      "AVG": 2.7,
      "TD": 0,
      "REC": 4,
      "REC_YDS": 35,
      "REC_TD": 0,
      "FPTS": 15.7
    },
    "projections_2025": {
      "CAR": 56,
      "YDS": 240,
      "AVG": 4.3,
      "TD": 2,
      "REC": 11,
      "REC_YDS": 76,
      "REC_TD": 0,
      "FPTS": 56.75
    },
    "outlook_2025": "Shipley is entering his second NFL season in position to earn the primary backup role behind Saquon Barkley. With Barkley dominating the touches and Kenneth Gainwell second in line for work, the 2024 fourth-round pick was limited to 34 touches in 16 games as a rookie, 14 of which came with the starters resting in Week 18. Granted it was a small sample, but Shipley wasn't overly effective (2.7 YPC), which aligns with his underwhelming collegiate efficiency. Still, with Gainwell now in Pittsburgh, Shipley has an opportunity to lock down one of the league's best insurance jobs. Should Barkley miss time, the 23-year-old would likely see enough work behind an elite line in a high-scoring offense to allow RB2/flex production. Shipley makes for a fine late-round dart throw."
  },
  {
    "rank": 163,
    "player_name": "Michael Wilson",
    "team": "Arizona Cardinals",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": 71,
      "REC": 47,
      "YDS": 548,
      "AVG": 11.7,
      "TD": 4,
      "CAR": 1,
      "RUSH_YDS": 7,
      "RUSH_TD": 0,
      "FPTS": 124.5
    },
    "projections_2025": {
      "TAR": 70,
      "REC": 47,
      "YDS": 523,
      "AVG": 11.2,
      "TD": 3,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 115.83
    },
    "outlook_2025": "Wilson is entering his third NFL season, including his second as Marvin Harrison Jr.'s running mate. The 2023 third-round pick was expected to make a Year 2 leap last season, but instead posted a receiving line (47-548-4) that was very similar to that of his rookie campaign (38-565-3) and in three more games. The 25-year-old's best season may be ahead of him, but he's going to be hard-pressed for consistent targets and fantasy output in an offense that features Harrison, Trey McBride and James Conner, and scores a substantial chunk of its touchdowns on the ground. Wilson's only path to the flex discussion will be if Harrison misses time, so he's not worth much late-round consideration."
  },
  {
    "rank": 164,
    "player_name": "Pat Bryant",
    "team": "Denver Broncos",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": null,
      "REC": null,
      "YDS": null,
      "AVG": null,
      "TD": null,
      "CAR": null,
      "RUSH_YDS": null,
      "RUSH_TD": null,
      "FPTS": null
    },
    "projections_2025": {
      "TAR": 54,
      "REC": 34,
      "YDS": 428,
      "AVG": 12.4,
      "TD": 3,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 95.89
    },
    "outlook_2025": "Bryant was selected by Denver in the third round of April's draft. He has decent size, but his lack of speed showed up at the combine (4.61 40-yard dash, 1.56 10-yard split) and his collegiate efficiency was fairly pedestrian. Bryant peaked with a 54-984-10 receiving line in 2024. On the plus side, he has a path to a major rookie-season role, with Marvin Mims Jr., Devaughn Vele and Troy Franklin as his competition for No. 2 duties opposite Courtland Sutton. Denver's Bo Nix-led offense is on the rise, so Bryant is well worth a flier in the late rounds."
  },
  {
    "rank": 165,
    "player_name": "Chig Okonkwo",
    "team": "Tennessee Titans",
    "position": "TE",
    "status": null,
    "statistics_2024": {
      "TAR": 70,
      "REC": 52,
      "YDS": 479,
      "AVG": 9.2,
      "TD": 2,
      "CAR": 1,
      "RUSH_YDS": 17,
      "RUSH_TD": 0,
      "FPTS": 113.6
    },
    "projections_2025": {
      "TAR": 87,
      "REC": 62,
      "YDS": 633,
      "AVG": 10.2,
      "TD": 3,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 144.54
    },
    "outlook_2025": "Okonkwo has settled in as a consistent contributor in Tennessee, having finished each of his three seasons in the range of 450 to 528 yards and 5.7 to 6.7 fantasy PPG. The 2022 fourth-round pick has yet to finish a season better than 15th in targets, catches, yards or TDs. Scoring has been a clear issue, as Okonkwo has 10 end zone targets and six TDs in 51 career games. On the plus side, he saw a huge spike in work late last season, producing 199 yards on 23 touches during Weeks 15-17 (his 28 targets ranked first and 43.9 fantasy points second among TEs during the span). There aren't many mouths to feed in Tennessee, so it's possible the 25-year-old can carry that momentum into 2025, but he'll need decent play from rookie QB Cam Ward. Okonkwo is best viewed as a back-end TE2."
  },
  {
    "rank": 166,
    "player_name": "Darren Waller",
    "team": "Miami Dolphins",
    "position": "TE",
    "status": "Out",
    "statistics_2024": {
      "TAR": null,
      "REC": null,
      "YDS": null,
      "AVG": null,
      "TD": null,
      "CAR": null,
      "RUSH_YDS": null,
      "RUSH_TD": null,
      "FPTS": null
    },
    "projections_2025": {
      "TAR": 86,
      "REC": 57,
      "YDS": 667,
      "AVG": 11.7,
      "TD": 3,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 144.29
    },
    "outlook_2025": "Waller ended his one-year retirement and was traded to the Dolphins in July. Once a fantasy star, Waller produced back-to-back top-3 fantasy campaigns during the 2019-20 seasons and was top 10 on a per-game basis the following two years. Of course, he just sat out an entire season, is set to turn 33 years old this fall, hasn't played more than 12 games in a season since 2020 and hasn't averaged double-digit fantasy points in a season since 2021. On the plus side, he has an easy path to snaps and targets and will be working in an offense that faces a ton of two-high looks and allowed Jonnu Smith to produce high-end TE1 numbers for most of 2024. Waller is worthy of late-round flier."
  },
  {
    "rank": 167,
    "player_name": "Zach Ertz",
    "team": "Washington Commanders",
    "position": "TE",
    "status": null,
    "statistics_2024": {
      "TAR": 91,
      "REC": 66,
      "YDS": 654,
      "AVG": 9.9,
      "TD": 7,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 177.4
    },
    "projections_2025": {
      "TAR": 81,
      "REC": 57,
      "YDS": 510,
      "AVG": 8.9,
      "TD": 5,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 140.19
    },
    "outlook_2025": "Ertz returns to Washington for his 13th NFL season after a very successful debut campaign with the team. One season after being waived by Arizona and failing to find his way to another 53-man roster, Ertz won the Commanders' starting TE gig and ended up in the top 12 at the position in routes, targets, catches, yards, TDs and fantasy points. His 10 end zone targets ranked second at the position. Ertz is now 34 years old and has added competition for targets with Deebo Samuel Sr. in town and Ben Sinnott entering Year 2, so a step back in production is probable, but he'll continue to benefit from playing a role in a Jayden Daniels-led offense. Ertz is best viewed as a low-ceiling TE2."
  },
  {
    "rank": 168,
    "player_name": "Jonnu Smith",
    "team": "Pittsburgh Steelers",
    "position": "TE",
    "status": "Questionable",
    "statistics_2024": {
      "TAR": 111,
      "REC": 88,
      "YDS": 884,
      "AVG": 10.0,
      "TD": 8,
      "CAR": 2,
      "RUSH_YDS": -1,
      "RUSH_TD": 0,
      "FPTS": 222.3
    },
    "projections_2025": {
      "TAR": 77,
      "REC": 56,
      "YDS": 569,
      "AVG": 10.1,
      "TD": 3,
      "CAR": 5,
      "RUSH_YDS": 19,
      "RUSH_TD": 0,
      "FPTS": 135.22
    },
    "outlook_2025": "Smith was traded to the Steelers in June following a career year in Miami in which he finished top 5 among tight ends in targets, receptions, yards, fantasy points and touchdowns. This after never finishing better than 15th in the former four categories during his first seven NFL seasons. Smith's season actually started slowly (4.9 targets per game and one game with 12-plus fantasy points during Weeks 1-10), but he averaged 8.5 targets and a position-high 18.6 PPG from Week 11 on. Smith is now reunited with Arthur Smith, which isn't necisarily a good thing, as averaged single-digit fantay points during three prior seasons with Smith calling the plays. Pittsburgh is shaky at wideout, so Smith will play plenty, but his target ceiling is much lower with Pat Freiermuth also in the mix. Smith is best valued as a mid-to-back-end TE2."
  },
  {
    "rank": 169,
    "player_name": "Texans D/ST",
    "team": "Houston Texans",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 49,
      "INT": 19,
      "FR": 9,
      "TD": 3,
      "PA": 370,
      "YA": 5355,
      "FPTS": 179.6
    },
    "projections_2025": {
      "SCK": 42,
      "INT": 14,
      "FR": 8,
      "TD": 3,
      "PA": 334,
      "YA": 5582,
      "FPTS": 173.66
    },
    "outlook_2025": "A sure-to-be-popular D/ST sleeper, the Texans are led by several individual defensive stars: All-Pro CB Derek Stingley Jr., DEs Will Anderson Jr. and Danielle Hunter (each had double-digit sacks), and free-agent addition LB E.J. Speed. Should all stay healthy, or some of the team's depth pieces materialize, this could be a sneaky, every-week unit. The Texans face a tougher early schedule (@LAR, TB in Weeks 1-2, @BAL in Week 5, Week 6 bye), but have several intriguing late-season matchups worth exploiting."
  },
  {
    "rank": 170,
    "player_name": "Steelers D/ST",
    "team": "Pittsburgh Steelers",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 40,
      "INT": 17,
      "FR": 16,
      "TD": 2,
      "PA": 335,
      "YA": 5554,
      "FPTS": 169.3
    },
    "projections_2025": {
      "SCK": 41,
      "INT": 12,
      "FR": 11,
      "TD": 3,
      "PA": 346,
      "YA": 5554,
      "FPTS": 176.1
    },
    "outlook_2025": "For all their talent up front, it was puzzling to see the 2024 Steelers total a middle-of-the-pack 40 sacks. DE T.J. Watt is one of the game's best at pressuring the quarterback, All-Pro DT Cameron Heyward rebounded as a 35-year-old, and DE Alex Highsmith further populates one of the game's deepest defensive fronts. The Steelers' early schedule sure looks good (@NYJ, SEA, @NE in Weeks 1-3), and potential growth in the sacks department buoys probable top-10 seasonal value."
  },
  {
    "rank": 171,
    "player_name": "Broncos D/ST",
    "team": "Denver Broncos",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 63,
      "INT": 15,
      "FR": 9,
      "TD": 5,
      "PA": 311,
      "YA": 5391,
      "FPTS": 210.2
    },
    "projections_2025": {
      "SCK": 44,
      "INT": 12,
      "FR": 7,
      "TD": 3,
      "PA": 344,
      "YA": 5612,
      "FPTS": 183.59
    },
    "outlook_2025": "Fantasy football's best-scoring defense last season, the Broncos took a stout overall unit, led by Defensive Player of the Year CB Pat Surtain II and All-Pro pass rusher DT Zach Allen, and bolstered it with S Talanoa Hufanga, LB Dre Greenlaw and first-round CB Jahdae Barron. Few NFL defenses are as talented and have as favorable a schedule in Weeks 1 and 2 (TEN, @IND) as the Broncos, making them the rare D/ST unit worth paying up for and sticking with for the duration."
  },
  {
    "rank": 172,
    "player_name": "Vikings D/ST",
    "team": "Minnesota Vikings",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 49,
      "INT": 24,
      "FR": 9,
      "TD": 3,
      "PA": 324,
      "YA": 5702,
      "FPTS": 171.5
    },
    "projections_2025": {
      "SCK": 44,
      "INT": 13,
      "FR": 8,
      "TD": 2,
      "PA": 362,
      "YA": 5608,
      "FPTS": 165.07
    },
    "outlook_2025": "Brian Flores' defense surged early in 2025, scoring a league-leading 117 fantasy points through 11 weeks, before cooling off late. The offseason additions of DTs Jonathan Allen and Javon Hargrave should strengthen their interior, though as members of the competitive NFC North, and with four games against the NFC East, the Vikings have one of the toughest D/ST schedules. Early middling matchups (@CHI, ATL in Weeks 1-2) should hint at the level of matchups homework involved with this intriguing defense."
  },
  {
    "rank": 173,
    "player_name": "Seahawks D/ST",
    "team": "Seattle Seahawks",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 45,
      "INT": 13,
      "FR": 5,
      "TD": 5,
      "PA": 358,
      "YA": 5656,
      "FPTS": 149.5
    },
    "projections_2025": {
      "SCK": 41,
      "INT": 14,
      "FR": 9,
      "TD": 2,
      "PA": 349,
      "YA": 5737,
      "FPTS": 152.87
    },
    "outlook_2025": "One of 2024's most opportunistic defenses, the Seahawks D/ST scored a league-high five touchdowns (tied with the Broncos), a number that's tough to repeat year over year. Nevertheless, Aden Durde's unit returns largely the same personnel, and even strengthened a sound defensive front with the addition of DE DeMarcus Lawrence. The Seahawks also benefit by drawing the NFC South and AFC South as opponents, giving them one of the more favorable schedules, particularly in the first six weeks (SF, @PIT, NO, @ARI, TB, @JAX)."
  },
  {
    "rank": 174,
    "player_name": "Ravens D/ST",
    "team": "Baltimore Ravens",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 54,
      "INT": 12,
      "FR": 5,
      "TD": 2,
      "PA": 357,
      "YA": 5511,
      "FPTS": 135.0
    },
    "projections_2025": {
      "SCK": 42,
      "INT": 14,
      "FR": 9,
      "TD": 2,
      "PA": 348,
      "YA": 5761,
      "FPTS": 162.98
    },
    "outlook_2025": "A historically strong defense, the Ravens had 50-plus sacks in 2023 and 2024, the only NFL team to do that, and they roster two All-Pros (CB Marlon Humphrey and LB Roquan Smith) and second-team S Kyle Hamilton. The addition of first-round S Malaki Starks boosts their secondary, and the Ravens have a generally sound schedule including two games each against the Browns and Steelers. Watch out for that tough opening-week matchup (@BUF), however."
  },
  {
    "rank": 175,
    "player_name": "Patriots D/ST",
    "team": "New England Patriots",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 28,
      "INT": 7,
      "FR": 5,
      "TD": 1,
      "PA": 399,
      "YA": 5829,
      "FPTS": 96.7
    },
    "projections_2025": {
      "SCK": 40,
      "INT": 13,
      "FR": 7,
      "TD": 2,
      "PA": 348,
      "YA": 5640,
      "FPTS": 171.66
    },
    "outlook_2025": "Coming off a miserable 2024 that saw them place last in sacks (28) and 30th in fantasy points, the Patriots changed their head coach (Mike Vrabel) and defensive coordinator (Terrell Williams), then spent big on DE Harold Landry III, LB Robert Spillane and CB Carlton Davis III to bolster the defense. Is it enough to propel the D/ST into fantasy relevance? We'll see, but the Patriots do have one of the game's softest schedules, especially early in the season (LV, @MIA, PIT, CAR, @BUF, @NO, @TEN, CLE first eight games)."
  },
  {
    "rank": 176,
    "player_name": "Lions D/ST",
    "team": "Detroit Lions",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 37,
      "INT": 16,
      "FR": 8,
      "TD": 2,
      "PA": 334,
      "YA": 5820,
      "FPTS": 152.3
    },
    "projections_2025": {
      "SCK": 43,
      "INT": 14,
      "FR": 7,
      "TD": 3,
      "PA": 362,
      "YA": 5664,
      "FPTS": 170.82
    },
    "outlook_2025": "Despite the early loss of DE Aidan Hutchinson, the Lions' defense managed to score the 12th-most fantasy points in 2024. That said, the unit faded badly down the stretch, ultimately finishing 32nd in pass defense, and defensive coordinator Aaron Glenn is now heading up the Jets (replaced by former linebackers coach Kelvin Sheppard). Hutchinson's healthy return will help, but the Lions' schedule is a doozy, with six games against projected top-eight offenses. They have top-10 talent, but their soft matchups are few and their downside is greater than most."
  },
  {
    "rank": 177,
    "player_name": "Eagles D/ST",
    "team": "Philadelphia Eagles",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 41,
      "INT": 13,
      "FR": 13,
      "TD": 1,
      "PA": 297,
      "YA": 4732,
      "FPTS": 169.7
    },
    "projections_2025": {
      "SCK": 41,
      "INT": 13,
      "FR": 11,
      "TD": 2,
      "PA": 384,
      "YA": 5943,
      "FPTS": 137.53
    },
    "outlook_2025": "The true shining star from the Eagles' Super Bowl LIX victory, Vic Fangio's defense features a stout secondary, All-Pro LB Zack Baun and first-round LB Jihaad Campbell, even if the unit suffered some key free agency losses (DE Josh Sweat, DT Milton Williams). After leading the league in fewest yards allowed, the Eagles will be a popular D/ST pick, but be mindful of their tough September schedule (DAL, @KC, LAR, @TB)."
  },
  {
    "rank": 178,
    "player_name": "Bills D/ST",
    "team": "Buffalo Bills",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 39,
      "INT": 16,
      "FR": 16,
      "TD": 3,
      "PA": 368,
      "YA": 5806,
      "FPTS": 157.8
    },
    "projections_2025": {
      "SCK": 43,
      "INT": 13,
      "FR": 10,
      "TD": 2,
      "PA": 369,
      "YA": 5961,
      "FPTS": 150.35
    },
    "outlook_2025": "Bills general manager Brandon Beane was a man of his word this offseason, going all-in on a defensive line that finished 2024 with only 39 sacks. In addition to signing five-time Pro Bowl DE Joey Bosa, the Bills drafted defensive linemen in Rounds 2 through 4 (and six defenders overall), bolstering a roster that has finished eighth or better in fantasy points in four straight seasons. If you're speculating on a fifth straight, merely be patient through their treacherous Week 1 matchup (BUF)."
  },
  {
    "rank": 179,
    "player_name": "Colts D/ST",
    "team": "Indianapolis Colts",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 36,
      "INT": 16,
      "FR": 9,
      "TD": 1,
      "PA": 415,
      "YA": 6140,
      "FPTS": 105.6
    },
    "projections_2025": {
      "SCK": 39,
      "INT": 12,
      "FR": 9,
      "TD": 2,
      "PA": 354,
      "YA": 5838,
      "FPTS": 150.43
    },
    "outlook_2025": "Lou Anarumo comes over from the Bengals to serve as the defensive coordinator for a Colts team that has the beginnings of a strong defensive front with DT DeForest Buckner and DE Laiatu Latu, and added free agents S Camryn Bynum and CB Charvarius Ward to bolster what was a weak secondary. There's enough talent here to make the Colts a decent matchups play, and bear in mind that they have one of the position's more favorable schedules. Watch their performances in the first two weeks and consider adding them for Week 3 (@TEN)."
  },
  {
    "rank": 180,
    "player_name": "Jets D/ST",
    "team": "New York Jets",
    "position": "D/ST",
    "status": null,
    "statistics_2024": {
      "SCK": 43,
      "INT": 7,
      "FR": 10,
      "TD": 1,
      "PA": 390,
      "YA": 5334,
      "FPTS": 123.8
    },
    "projections_2025": {
      "SCK": 36,
      "INT": 12,
      "FR": 7,
      "TD": 2,
      "PA": 370,
      "YA": 5812,
      "FPTS": 132.87
    },
    "outlook_2025": "Though the secondary has been the Jets' defensive strength the past two seasons, it was more inconsistent in 2024 and the team has since replaced departed CB D.J. Reed with Brandon Stephens. Nevertheless, new defensive coordinator Steve Wilks should get the most out of this unit, and an opening matchup against their former QB, Aaron Rodgers, and the Steelers is quite a good one. And looking beyond that, the Jets have very much the feel of an opportunistic, matchups-oriented D/ST."
  },
  {
    "rank": 181,
    "player_name": "Jake Bates",
    "team": "Detroit Lions",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "13/13",
      "40-49": "7/8",
      "50+": "6/8",
      "TOT": "26/29",
      "XP": "64/67",
      "FPTS": 158.0
    },
    "projections_2025": {
      "1-39": "16/17",
      "40-49": "7/9",
      "50+": "5/7",
      "TOT": "29/33",
      "XP": "46/47",
      "FPTS": 144.82
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 182,
    "player_name": "Chase McLaughlin",
    "team": "Tampa Bay Buccaneers",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "18/18",
      "40-49": "4/4",
      "50+": "8/10",
      "TOT": "30/32",
      "XP": "54/56",
      "FPTS": 162.0
    },
    "projections_2025": {
      "1-39": "16/17",
      "40-49": "8/9",
      "50+": "5/7",
      "TOT": "29/33",
      "XP": "44/45",
      "FPTS": 146.33
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 183,
    "player_name": "Cameron Dicker",
    "team": "Los Angeles Chargers",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "19/19",
      "40-49": "11/12",
      "50+": "9/11",
      "TOT": "39/42",
      "XP": "33/36",
      "FPTS": 176.0
    },
    "projections_2025": {
      "1-39": "17/17",
      "40-49": "8/9",
      "50+": "5/7",
      "TOT": "30/33",
      "XP": "40/41",
      "FPTS": 143.72
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 184,
    "player_name": "Brandon Aubrey",
    "team": "Dallas Cowboys",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "12/14",
      "40-49": "14/16",
      "50+": "14/17",
      "TOT": "40/47",
      "XP": "30/30",
      "FPTS": 185.0
    },
    "projections_2025": {
      "1-39": "17/17",
      "40-49": "8/9",
      "50+": "5/7",
      "TOT": "29/33",
      "XP": "39/40",
      "FPTS": 142.22
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 185,
    "player_name": "Jason Sanders",
    "team": "Miami Dolphins",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "20/20",
      "40-49": "5/7",
      "50+": "12/14",
      "TOT": "37/41",
      "XP": "26/28",
      "FPTS": 162.0
    },
    "projections_2025": {
      "1-39": "17/17",
      "40-49": "8/9",
      "50+": "5/7",
      "TOT": "29/33",
      "XP": "40/40",
      "FPTS": 140.6
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 186,
    "player_name": "Tyler Bass",
    "team": "Buffalo Bills",
    "position": "K",
    "status": "Questionable",
    "statistics_2024": {
      "1-39": "13/14",
      "40-49": "7/11",
      "50+": "4/4",
      "TOT": "24/29",
      "XP": "59/64",
      "FPTS": 141.0
    },
    "projections_2025": {
      "1-39": "15/17",
      "40-49": "7/9",
      "50+": "5/7",
      "TOT": "27/33",
      "XP": "49/53",
      "FPTS": 141.25
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 187,
    "player_name": "Jake Elliott",
    "team": "Philadelphia Eagles",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "19/20",
      "40-49": "8/9",
      "50+": "1/7",
      "TOT": "28/36",
      "XP": "47/48",
      "FPTS": 133.0
    },
    "projections_2025": {
      "1-39": "16/17",
      "40-49": "7/9",
      "50+": "5/7",
      "TOT": "28/33",
      "XP": "45/48",
      "FPTS": 141.12
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 188,
    "player_name": "Chris Boswell",
    "team": "Pittsburgh Steelers",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "21/21",
      "40-49": "7/8",
      "50+": "13/15",
      "TOT": "41/44",
      "XP": "35/35",
      "FPTS": 188.0
    },
    "projections_2025": {
      "1-39": "17/17",
      "40-49": "8/9",
      "50+": "5/7",
      "TOT": "30/33",
      "XP": "35/36",
      "FPTS": 138.2
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 189,
    "player_name": "Harrison Butker",
    "team": "Kansas City Chiefs",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "15/16",
      "40-49": "4/4",
      "50+": "2/5",
      "TOT": "21/25",
      "XP": "29/31",
      "FPTS": 96.0
    },
    "projections_2025": {
      "1-39": "16/17",
      "40-49": "7/9",
      "50+": "5/7",
      "TOT": "28/33",
      "XP": "43/45",
      "FPTS": 138.9
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 190,
    "player_name": "Cairo Santos",
    "team": "Chicago Bears",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "8/8",
      "40-49": "5/8",
      "50+": "8/9",
      "TOT": "21/25",
      "XP": "25/26",
      "FPTS": 105.0
    },
    "projections_2025": {
      "1-39": "16/17",
      "40-49": "7/9",
      "50+": "5/7",
      "TOT": "29/33",
      "XP": "39/40",
      "FPTS": 139.56
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 191,
    "player_name": "Tyler Loop",
    "team": "Baltimore Ravens",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": null,
      "40-49": null,
      "50+": null,
      "TOT": null,
      "XP": null,
      "FPTS": null
    },
    "projections_2025": {
      "1-39": "15/17",
      "40-49": "7/9",
      "50+": "5/7",
      "TOT": "27/33",
      "XP": "48/52",
      "FPTS": 139.98
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 192,
    "player_name": "Matt Gay",
    "team": "Washington Commanders",
    "position": "K",
    "status": null,
    "statistics_2024": {
      "1-39": "21/21",
      "40-49": "7/7",
      "50+": "3/9",
      "TOT": "31/37",
      "XP": "33/33",
      "FPTS": 133.0
    },
    "projections_2025": {
      "1-39": "16/17",
      "40-49": "7/9",
      "50+": "5/7",
      "TOT": "28/33",
      "XP": "45/47",
      "FPTS": 139.99
    },
    "outlook_2025": "No outlook available."
  },
  {
    "rank": 193,
    "player_name": "Christian Kirk",
    "team": "Houston Texans",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": 47,
      "REC": 27,
      "YDS": 379,
      "AVG": 14.0,
      "TD": 1,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 70.9
    },
    "projections_2025": {
      "TAR": 66,
      "REC": 42,
      "YDS": 539,
      "AVG": 12.9,
      "TD": 3,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 110.7
    },
    "outlook_2025": "Kirk was traded to Houston after spending his first seven NFL seasons in Arizona and Jacksonville. He peaked in 2022 when he posted career-high marks across the board and finished 18th among WRs in fantasy PPG, but that marks his only career top-30 season. Last season, he missed nine games and, while he did have a few solid outings (12-plus points three weeks in a row), he averaged a career-low 8.9 PPG on the season. With Tank Dell (knee) in doubt for 2025, Kirk will compete with rookies Jayden Higgins and Jaylin Noel for No. 2 receiver duties opposite Nico Collins, and he figures to work as the team's primary slot receiver. There's not much upside here (he's cleared six TDs once in his career), so Kirk should be viewed as no more than a late-round pick."
  },
  {
    "rank": 194,
    "player_name": "Romeo Doubs",
    "team": "Green Bay Packers",
    "position": "WR",
    "status": "Questionable",
    "statistics_2024": {
      "TAR": 72,
      "REC": 46,
      "YDS": 601,
      "AVG": 13.1,
      "TD": 4,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 132.1
    },
    "projections_2025": {
      "TAR": 76,
      "REC": 48,
      "YDS": 575,
      "AVG": 12.1,
      "TD": 4,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 128.5
    },
    "outlook_2025": "Doubs returns to Green Bay for his fourth NFL season. The 2022 fourth-round pick leads the team in targets (237), receptions (147), receiving yards (1,700) and receiving TDs (15) since his arrival, but that's resulted in only 9.5 fantasy points per game. He peaked with a 59-674-8 receiving line in 2023 and has yet to post a top-45 fantasy season (PPG). The 25-year-old has minimal upside (zero top-10 fantasy outings last season) and substantial competition for targets, with rookies Matthew Golden and Savion Williams joining a WR group that also includes Jayden Reed, Dontayvion Wicks and eventually Christian Watson (ACL recovery). Add in an offensive scheme that leans heavily on Josh Jacobs near the goal line and Doubs' inconsistent usage and limited upside makes him no more than a bench option in fantasy."
  },
  {
    "rank": 195,
    "player_name": "Justice Hill",
    "team": "Baltimore Ravens",
    "position": "RB",
    "status": null,
    "statistics_2024": {
      "CAR": 47,
      "YDS": 228,
      "AVG": 4.9,
      "TD": 1,
      "REC": 42,
      "REC_YDS": 383,
      "REC_TD": 3,
      "FPTS": 127.1
    },
    "projections_2025": {
      "CAR": 41,
      "YDS": 185,
      "AVG": 4.5,
      "TD": 1,
      "REC": 38,
      "REC_YDS": 316,
      "REC_TD": 2,
      "FPTS": 108.05
    },
    "outlook_2025": "Hill is back for his sixth season in Baltimore, including his second as Derrick Henry's running mate. Hill isn't much of a factor as a rusher (he's never cleared 84 carries in a season), but he's played just a hair over 40% of the Ravens' offensive snaps"
  },
  {
    "rank": 196,
    "player_name": "Kareem Hunt",
    "team": "Kansas City Chiefs",
    "position": "RB",
    "status": "Questionable",
    "statistics_2024": {
      "CAR": 200,
      "YDS": 728,
      "AVG": 3.6,
      "TD": 7,
      "REC": 23,
      "REC_YDS": 176,
      "REC_TD": 0,
      "FPTS": 155.4
    },
    "projections_2025": {
      "CAR": 66,
      "YDS": 262,
      "AVG": 4.0,
      "TD": 3,
      "REC": 14,
      "REC_YDS": 88,
      "REC_TD": 1,
      "FPTS": 70.9
    },
    "outlook_2025": "Hunt re-signed with the Chiefs following a successful reunion with the team last season. He stepped in for an injured Isiah Pacheco in Week 4 and went on to average 21.5 touches, 89.0 yards and 14.8 fantasy points over the next eight games. Pacheco returned in Week 13 and then neither were viable fantasy options from that point forward, as they were near even in snaps, carries and targets, with Samaje Perine also in the mix as a passing-down specialist. Hunt was not particularly effective as a rusher or receiver and he's now 30 years old, so it's fair to expect a healthy Pacheco to lead this backfield in 2025. Hunt is only a late-round consideration."
  },
  {
    "rank": 197,
    "player_name": "Tyler Lockett",
    "team": "Tennessee Titans",
    "position": "WR",
    "status": null,
    "statistics_2024": {
      "TAR": 74,
      "REC": 49,
      "YDS": 600,
      "AVG": 12.2,
      "TD": 2,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 121.0
    },
    "projections_2025": {
      "TAR": 71,
      "REC": 46,
      "YDS": 497,
      "AVG": 10.7,
      "TD": 4,
      "CAR": 0,
      "RUSH_YDS": 0,
      "RUSH_TD": 0,
      "FPTS": 117.46
    },
    "outlook_2025": "Lockett signed with the Titans after spending his first 10 seasons in Seattle. The 2015 third-round pick peaked with five consecutive top-16 fantasy campaigns from 2018 to 2022, but slipped to 32nd in 2023 before plummeting to 66th last season. Lockett's role drastically declined last season (74 targets after 107-plus the prior five years), which led to his worst showings in catches, yards and TDs since 2017. While he's expected to operate as Tennessee's No. 2 receiver behind Calvin Ridley, Lockett is now 32 years old and will be working with a rookie quarterback in Cam Ward. He's worth no more than a late flier."
  },
  {
    "rank": 198,
    "player_name": "Trevor Lawrence",
    "team": "Jacksonville Jaguars",
    "position": "QB",
    "status": null,
    "statistics_2024": {
      "C/A": "172/284",
      "YDS": 2045,
      "TD": 11,
      "INT": 7,
      "CAR": 26,
      "RUSH_YDS": 119,
      "RUSH_TD": 3,
      "FPTS": 166.2
    },
    "projections_2025": {
      "C/A": "384/592",
      "YDS": 4275,
      "TD": 22,
      "INT": 14,
      "CAR": 60,
      "RUSH_YDS": 283,
      "RUSH_TD": 4,
      "FPTS": 323.68
    },
    "outlook_2025": "Lawrence is entering his fifth NFL season eyeing a bounce-back after an injury-plagued 2024. Lawrence played the bulk of the snaps in nine games and averaged 16.1 fantasy PPG. That would've ranked 15th over the full season and is actually a slight step back from 17.4 in 2022 and 16.4 in 2023. The former No. 1 overall pick has yet to deliver a top-10 fantasy campaign (PPG) and that's despite finishing each of his first three NFL seasons in the top 10 among QBs in pass attempts, carries and rush yards. Lawrence is a solid player who adds just enough with his arm and legs to hang in the QB2 mix. His ceiling has obviously been low, but perhaps the presence of Brian Thomas Jr., Travis Hunter and new head coach Liam Coen can get him to the next level. He's a fine but unspectacular late-round pick."
  },
  {
    "rank": 199,
    "player_name": "Cameron Ward",
    "team": "Tennessee Titans",
    "position": "QB",
    "status": null,
    "statistics_2024": {
      "C/A": null,
      "YDS": null,
      "TD": null,
      "INT": null,
      "CAR": null,
      "RUSH_YDS": null,
      "RUSH_TD": null,
      "FPTS": null
    },
    "projections_2025": {
      "C/A": "351/562",
      "YDS": 3822,
      "TD": 23,
      "INT": 14,
      "CAR": 65,
      "RUSH_YDS": 298,
      "RUSH_TD": 2,
      "FPTS": 301.22
    },
    "outlook_2025": "Ward was selected by Tennessee with the No. 1 pick in April's draft. Ward tossed a class-high 39 TDs and his 88.7 QBR trailed only Will Howard last season -- his lone year at Miami. He didn't run a ton, but was effective when he did (class-best 9.1 YPC and a ridiculous 79% of his 38 carries went for 5-plus yards). Ward is all but a lock to start in Week 1, and his supporting cast is serviceable, but there will be bumps along the way. So, unless he runs more than expected, he's unlikely to be more than an occasional streamer as a rookie. Consider him only as a late-round flier."
  },
  {
    "rank": 200,
    "player_name": "Michael Penix Jr.",
    "team": "Atlanta Falcons",
    "position": "QB",
    "status": null,
    "statistics_2024": {
      "C/A": "61/105",
      "YDS": 775,
      "TD": 3,
      "INT": 3,
      "CAR": 7,
      "RUSH_YDS": 11,
      "RUSH_TD": 1,
      "FPTS": 49.5
    },
    "projections_2025": {
      "C/A": "347/545",
      "YDS": 3961,
      "TD": 23,
      "INT": 13,
      "CAR": 47,
      "RUSH_YDS": 187,
      "RUSH_TD": 3,
      "FPTS": 295.85
    },
    "outlook_2025": "Penix is entering his second NFL season and his first as Atlanta's starter. The 2024 No. 8 pick played only three full games as a rookie, with mixed results. He threw for 200-plus yards and one INT in all three, totaling three passing TDs during the stretch. Though he did produce one rushing TD, he was (as expected) a nonfactor with his legs, totaling 11 yards on seven carries. Penix will benefit from a very good supporting cast led by Drake London and Bijan Robinson, but he'll be working in an offense that was third-run-heaviest in the league last season and he's unlikely to add much (if any) value with his legs. Penix should be viewed as no more than a late-round lottery ticket."
  }
]
