[
  {
  
    
      "rank": 201,
      "player_name": "DeMario Douglas",
      "team": "New England Patriots",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 87,
        "REC": 66,
        "YDS": 621,
        "AVG": 9.4,
        "TD": 3,
        "CAR": 3,
        "RUSH_YDS": 16,
        "RUSH_TD": 0,
        "FPTS": 147.7
      },
      "projections_2025": {
        "TAR": 76,
        "REC": 53,
        "YDS": 594,
        "AVG": 11.3,
        "TD": 3,
        "CAR": 2,
        "RUSH_YDS": 14,
        "RUSH_TD": 0,
        "FPTS": 130.57
      },
      "outlook_2025": "Douglas is entering his third NFL season having paced the Patriots' WR room in targets during each of his first two years with the team. The 2023 sixth-round pick earned a significant offensive role early in his rookie season and took a slight leap forward last season, hitting career-best marks in targets, catches, yardage and TDs. One of the league's smallest receivers at 5-foot-8, 179 pounds, Douglas primarily works as a short-area slot receiver, which has severely limited his yardage, TDs and, of course, fantasy output. The 24-year-old has yet to deliver a top-55 fantasy campaign (PPG) and is a candidate for a lesser role in 2025 with Stefon Diggs and Kyle Williams in the mix on what is likely to be a run-first offense under Mike Vrabel. Douglas has minimal late-round appeal."
    },
    {
      "rank": 202,
      "player_name": "Nick Westbrook-Ikhine",
      "team": "Miami Dolphins",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 60,
        "REC": 32,
        "YDS": 497,
        "AVG": 15.5,
        "TD": 9,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 135.7
      },
      "projections_2025": {
        "TAR": 59,
        "REC": 34,
        "YDS": 486,
        "AVG": 14.4,
        "TD": 4,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 108.94
      },
      "outlook_2025": "Westbrook-Ikhine signed with the Dolphins after spending his first five seasons in Tennessee. The 2020 UDFA has settled in as a reliable situational receiver and spot starter, having posted a target share in the 11-12% range four years in a row. Though he was limited to 60 targets last season, Westbrook-Ikhine broke math by scoring nine TDs on 32 catches. Eight of the scores game in an eight game stretch in which he caught just 20 passes and his WR-best 15.0% TD rate is obviously nowhere close to sustainable. The 28-year-old will battle for No. 3 WR duties behind Tyreek Hill and Jaylen Waddle. He should only be added to your roster in deep leagues if Hill or Waddle miss time."
    },
    {
      "rank": 203,
      "player_name": "Joshua Palmer",
      "team": "Buffalo Bills",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 65,
        "REC": 39,
        "YDS": 584,
        "AVG": 15.0,
        "TD": 1,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 107.4
      },
      "projections_2025": {
        "TAR": 66,
        "REC": 42,
        "YDS": 505,
        "AVG": 12.1,
        "TD": 3,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 111.43
      },
      "outlook_2025": "Palmer signed with the Bills during free agency after spending his first four NFL seasons with the Chargers. The 2021 third-round pick peaked with a 72-catch, 769-yard showing back in 2022, but that was only good enough for a 43rd-place finish in fantasy PPG. He's seen his TD total decrease each year since a career best four in 2021 and has missed 10 games due to injury over the last three seasons. The 25-year-old will battle with Khalil Shakir, Keon Coleman and Curtis Samuel for wide receiver reps and is a long shot for consistent targets. He may occasionally make for a flex dart throw, but that's likely his ceiling."
    },
    {
      "rank": 204,
      "player_name": "Diontae Johnson",
      "team": "Cleveland Browns",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 67,
        "REC": 33,
        "YDS": 375,
        "AVG": 11.4,
        "TD": 3,
        "CAR": 2,
        "RUSH_YDS": 6,
        "RUSH_TD": 0,
        "FPTS": 89.1
      },
      "projections_2025": {
        "TAR": 68,
        "REC": 37,
        "YDS": 465,
        "AVG": 12.5,
        "TD": 3,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 99.1
      },
      "outlook_2025": "Johnson signed with the Browns following April's draft after a tumultuous 2024 campaign spent with Carolina, Baltimore and Houston. Johnson remained a heavily targeted receiver during his seven games in Carolina (8.3 targets per game), but his output was boom/bust (19-plus fantasy points three times, but fewer than six points the other four weeks) and he was then traded to and released by the Ravens prior to landing with the Texans. Things went very poorly in the final two stops, as he totaled three catches in five games. Johnson enters his age-29 season set to compete with Cedric Tillman for No. 2 WR duties behind Jerry Jeudy in an offense that has major question marks at quarterback. It's possible he could find his way back into the flex discussion (he finished in the top 40 in PPG four straight seasons from 2020 to 2023), but it's more likely his days of fantasy relevance are over."
    },
    {
      "rank": 205,
      "player_name": "Brandin Cooks",
      "team": "New Orleans Saints",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 54,
        "REC": 26,
        "YDS": 259,
        "AVG": 10.0,
        "TD": 3,
        "CAR": 3,
        "RUSH_YDS": -3,
        "RUSH_TD": 0,
        "FPTS": 69.6
      },
      "projections_2025": {
        "TAR": 72,
        "REC": 41,
        "YDS": 495,
        "AVG": 12.0,
        "TD": 3,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 108.39
      },
      "outlook_2025": "Cooks reunited with the Saints -- the team that drafted him in 2014 -- after bouncing around the league (four stops) since departing New Orleans in 2017. The former first-round pick has had his stretches of WR2 production (seven of 11 seasons have resulted in a top-25 finish in fantasy PPG), but he hasn't had a finish better than 37th since 2021 and he fell to a career-low 76th in 2024. Now 31 years old, Cooks is expected to slide in as the Saints' No. 3 receiver behind Chris Olave and Rashid Shaheed. He'll likely see a handful of targets most weeks, but consistent fantasy output is a long shot, especially with rookie Tyler Shough under center. Cooks is worth consideration only in the late rounds."
    },
    {
      "rank": 206,
      "player_name": "Brenton Strange",
      "team": "Jacksonville Jaguars",
      "position": "TE",
      "status": null,
      "statistics_2024": {
        "TAR": 53,
        "REC": 40,
        "YDS": 411,
        "AVG": 10.3,
        "TD": 2,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 91.1
      },
      "projections_2025": {
        "TAR": 86,
        "REC": 61,
        "YDS": 583,
        "AVG": 9.5,
        "TD": 3,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 139.86
      },
      "outlook_2025": "Strange is the new No. 1 tight end in Jacksonville following the release of Evan Engram. We got a preview of this last season when Engram was sidelined for eight games. In those weeks, Strange played 72% of the snaps and handled a solid 14.6% target share (4.9 per game). That led to one big fantasy outing (12-11-73-0 in Week 15), but he otherwise averaged 6.9 fantasy PPG and failed to clear 12.4 points in any of the other seven games. Perhaps Strange gets to another level in Year 3, but, especially with Brian Thomas Jr. and Travis Hunter set to be featured, the 2023 second-round pick seems likely to settle in as a low-ceiling TE2."
    },
    {
      "rank": 207,
      "player_name": "Mason Taylor",
      "team": "New York Jets",
      "position": "TE",
      "status": null,
      "statistics_2024": null,
      "projections_2025": {
        "TAR": 79,
        "REC": 55,
        "YDS": 570,
        "AVG": 10.4,
        "TD": 3,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 129.22
      },
      "outlook_2025": "Taylor was selected by the Jets in the second round of April's draft. He posted poor marks in YPT (7.2) and YPRR (1.20) across his 38 collegiate games, but Jason's son did catch 36-plus passes in all three seasons. Taylor is one of the youngest (21) tight ends in this class and may require some development, but he's also well positioned for a sizable Year 1 role with Jeremy Ruckert as his top competition for the starting job, not to mention the Jets' lack of depth at wide receiver. It wouldn't be a shock if Taylor finished 2025 second to only Garrett Wilson in targets, so even in what will be a low-volume passing game with Justin Fields under center, Taylor is a fine late-round dart throw in deeper leagues."
    },
    {
      "rank": 208,
      "player_name": "Darius Slayton",
      "team": "New York Giants",
      "position": "WR",
      "status": "Questionable",
      "statistics_2024": {
        "TAR": 71,
        "REC": 39,
        "YDS": 573,
        "AVG": 14.7,
        "TD": 2,
        "CAR": 2,
        "RUSH_YDS": 17,
        "RUSH_TD": 0,
        "FPTS": 110.0
      },
      "projections_2025": {
        "TAR": 69,
        "REC": 38,
        "YDS": 568,
        "AVG": 14.8,
        "TD": 3,
        "CAR": 2,
        "RUSH_YDS": 13,
        "RUSH_TD": 0,
        "FPTS": 114.75
      },
      "outlook_2025": "Slayton re-signed with the Giants and is entering his seventh season with the team after they selected him in the fifth round back in 2019. He plays a lot of snaps (80%-plus snap share two years in a row), but he's not targeted much (4.4 per game last season) and hasn't finished a season better than 39th in fantasy PPG (or better than 54th since 2020). Slayton has yet to clear 770 yards in a season and he hasn't scored more than four TDs in a season since 2019. The 28-year-old will work opposite Malik Nabers (with Wan'Dale Robinson in the slot) again this season, and, even with a QB upgrade to Russell Wilson, he's well off the fantasy radar."
    },
    {
      "rank": 209,
      "player_name": "DeAndre Hopkins",
      "team": "Baltimore Ravens",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 80,
        "REC": 56,
        "YDS": 610,
        "AVG": 10.9,
        "TD": 5,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 147.0
      },
      "projections_2025": {
        "TAR": 46,
        "REC": 29,
        "YDS": 342,
        "AVG": 11.6,
        "TD": 4,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 86.39
      },
      "outlook_2025": "Hopkins signed with the Ravens, which will be his fifth NFL team in 13 seasons. The future Hall of Famer was a featured target as recently as 2023 in Tennessee, but his usage dropped off drastically early last season (3.5 targets per game in six games with the Titans) and wasn't much better following a trade to Kansas City. He had one huge game (28.6 points in Week 9), but otherwise was a situational player, averaging 5.1 targets and 9.4 fantasy points per game in 13 outings with the team, including a very limited playoff role. Hopkins' days as a lineup lock are over and that's especially the case at 33-years-old in a run-friendly Baltimore offense that spreads the ball around quite a bit. Expect Hopkins to battle for No. 3 WR duties behind Zay Flowers and Rashod Bateman. He's no more than a bench option."
    },
    {
      "rank": 210,
      "player_name": "Quentin Johnston",
      "team": "Los Angeles Chargers",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 91,
        "REC": 55,
        "YDS": 711,
        "AVG": 12.9,
        "TD": 8,
        "CAR": 3,
        "RUSH_YDS": 6,
        "RUSH_TD": 0,
        "FPTS": 174.7
      },
      "projections_2025": {
        "TAR": 56,
        "REC": 32,
        "YDS": 461,
        "AVG": 14.2,
        "TD": 3,
        "CAR": 2,
        "RUSH_YDS": 12,
        "RUSH_TD": 0,
        "FPTS": 98.6
      },
      "outlook_2025": "The 21st overall pick back in 2023, Johnston had the look of a bust after struggling to a 38-431-2 receiving line as a rookie. Things improved under a new coaching staff in Year 2, with Johnston doubling his rookie-season target share (from 11% to 22%) and scoring eight TDs (12th most among receivers). His production was inconsistent, however, as 43% of his fantasy points came in three games and he had seven single-digit outings. He finished 39th or lower in snaps, routes, targets, catches, yards and fantasy PPG, so, if he's going to join the WR3/flex discussion, he'll need a volume boost in order to offset TD regression to the mean (4.8 xTD). That boost is unlikely, as he'll now have to battle Keenan Allen and rookie Tre Harris for work behind Ladd McConkey. Johnston is barely worth a late flier."
    },
    {
      "rank": 211,
      "player_name": "Dont'e Thornton Jr.",
      "team": "Las Vegas Raiders",
      "position": "WR",
      "status": null,
      "statistics_2024": null,
      "projections_2025": {
        "TAR": 40,
        "REC": 26,
        "YDS": 317,
        "AVG": 12.1,
        "TD": 1,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 66.7
      },
      "outlook_2025": "Thornton was selected by the Raiders in the fourth round of April's draft. He is a vertical threat who ranked at or near the top of this WR class in YPR (25.4), YPT (18.9), aDOT (16.4) and RAC (10.7) last season, albeit in a situational role (35 targets, 9% share). In fact, Thornton was used sparingly throughout his four collegiate seasons, totaling a 6.1% target share (second lowest in this WR class) and 65-1,426-10 receiving line. He posted the best speed score (120) among WRs at the combine (4.30 40 at 6-foot-4, 205 pounds). Thornton is likely headed for a situational deep-threat role behind Jakobi Meyers and Jack Bech (not to mention TE Brock Bowers), and he should be drafted only in dynasty formats."
    },
    {
      "rank": 212,
      "player_name": "Blake Corum",
      "team": "Los Angeles Rams",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 58,
        "RUSH_YDS": 207,
        "RUSH_AVG": 3.6,
        "RUSH_TD": 0,
        "REC": 7,
        "REC_YDS": 58,
        "REC_TD": 0,
        "FPTS": 33.5
      },
      "projections_2025": {
        "CAR": 58,
        "RUSH_YDS": 246,
        "RUSH_AVG": 4.2,
        "RUSH_TD": 2,
        "REC": 9,
        "REC_YDS": 63,
        "REC_TD": 0,
        "FPTS": 52.44
      },
      "outlook_2025": "Corum enters his second NFL season likely to play a larger role after being limited to 65 touches as a rookie. The 2024 third-round pick opened the season third on the Rams' depth chart and, though he eventually passed Ronnie Rivers, he was never a threat to Kyren Williams' feature-back role. Corum wasn't overly impressive as a rookie, but he makes for an intriguing insurance stash, because Williams has totaled a massive 663 touches (third most) over the past two seasons, including the playoffs. Should Williams miss time, Corum would likely work ahead of rookie Jarquez Hunter as the lead back in a good Rams offense. He's worth a late-round flier."
    },
    {
      "rank": 213,
      "player_name": "Nick Chubb",
      "team": "Houston Texans",
      "position": "RB",
      "status": "Questionable",
      "statistics_2024": {
        "CAR": 102,
        "RUSH_YDS": 332,
        "RUSH_AVG": 3.3,
        "RUSH_TD": 3,
        "REC": 5,
        "REC_YDS": 31,
        "REC_TD": 1,
        "FPTS": 63.3
      },
      "projections_2025": {
        "CAR": 122,
        "RUSH_YDS": 533,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 4,
        "REC": 8,
        "REC_YDS": 65,
        "REC_TD": 0,
        "FPTS": 95.72
      },
      "outlook_2025": "Chubb signed with the Texans during the offseason. Once one of the league's best rushers, Chubb has been riddled by injuries over the past two seasons. He missed all but two games in 2023 due to a major knee injury and, after returning for eight games in 2024, a broken foot cost him the final three games of the season. Chubb was not his usual, elite self when active last season, averaging 3.3 yards per carry while playing only 40% of Cleveland's offensive snaps. Now more than a year removed from the knee injury, perhaps Chubb can get back on track in 2025, but that will be a tough road at age 29 and without a clear path to consistent usage. He figures to handle change-of-pace carries behind Joe Mixon and little to no work in the passing game. He's worth no more than a late flier on draft day."
    },
    {
      "rank": 214,
      "player_name": "Woody Marks",
      "team": "Houston Texans",
      "position": "RB",
      "status": null,
      "statistics_2024": null,
      "projections_2025": {
        "CAR": 45,
        "RUSH_YDS": 194,
        "RUSH_AVG": 4.3,
        "RUSH_TD": 1,
        "REC": 17,
        "REC_YDS": 124,
        "REC_TD": 1,
        "FPTS": 59.01
      },
      "outlook_2025": "Marks was selected by Houston in the fourth round of April's draft. He was a pass-catching machine during his collegiate career, posting a 261-1,546-5 receiving line on 317 targets, more than doubling the next-closest back in routes, targets and catches. On the other hand, he ranked near the bottom of this RB class in YAC and forced missed tackle rate last season and during his career, including a career 2.41 YAC, which is easily worst in this class. Marks underwhelmed across the board at the combine, including a 4.54 40. The 24-year-old will immediately compete with Nick Chubb, Dare Ogunbowale and Dameon Pierce for No. 2 duties behind lead back Joe Mixon. Marks has some insurance appeal and is worth a flier in the late rounds of deep leagues."
    },
    {
      "rank": 215,
      "player_name": "Cade Otton",
      "team": "Tampa Bay Buccaneers",
      "position": "TE",
      "status": "Questionable",
      "statistics_2024": {
        "TAR": 87,
        "REC": 59,
        "YDS": 600,
        "AVG": 10.2,
        "TD": 4,
        "CAR": 1,
        "RUSH_YDS": -4,
        "RUSH_TD": 0,
        "FPTS": 140.6
      },
      "projections_2025": {
        "TAR": 77,
        "REC": 52,
        "YDS": 554,
        "AVG": 10.7,
        "TD": 5,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 137.69
      },
      "outlook_2025": "Following two solid but unspectacular seasons to begin his NFL career, Otton made a big leap in 2024, finishing in the top 15 among TEs in snaps, routes, targets, receptions, yards, TDs and fantasy points. Injuries around him were a factor, however, as he handled a solid 16% target share (4.8 per game) but was limited to a 29-307-1 receiving line (6.3 fantasy PPG and no games over 11.2) in 10 games with Mike Evans also in the lineup. Then, during Weeks 7-10 with Evans injured (Chris Godwin also missed most of this action), Otton handled a 25% target share (9.5 per game, 8-plus in all four) and posted a 30-293-3 receiving line (19.3 PPG with 18-plus three times). With Tampa Bay's loaded WR room and heavy reliance on its RBs, Otton figures to head back to low-ceiling TE2 production."
    },
    {
      "rank": 216,
      "player_name": "Pat Freiermuth",
      "team": "Pittsburgh Steelers",
      "position": "TE",
      "status": null,
      "statistics_2024": {
        "TAR": 78,
        "REC": 65,
        "YDS": 653,
        "AVG": 10.0,
        "TD": 7,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 168.3
      },
      "projections_2025": {
        "TAR": 82,
        "REC": 62,
        "YDS": 541,
        "AVG": 8.7,
        "TD": 3,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 134.04
      },
      "outlook_2025": "Freiermuth is entering his fifth NFL season having yet to emerge as a viable fantasy starter. The 2021 second-round pick peaked with an 11th-place finish in fantasy PPG in 2022 and, despite catching a career-high 65 passes and matching a career best with seven TDs last season, he ended up 14th in PPG. One concern here is that the TD output is unsustainable, as Freiermuth ranked 20th in expected TDs (3.1, which aligned with where he was when he scored two TDs in both 2022 and 2023) and had a career-low two end zone targets. Another concern is the acquisition of Jonnu Smith, who even in an offense short on WR depth, is sure to cut into Freiermuth's target share. The arrival of Aaron Rodgers helps his cause a bit, and he may settle in second in target priority behind DK Metcalf, but there's not much of a ceiling here. Freiermuth is a mid-to-back-end TE2."
    },
    {
      "rank": 217,
      "player_name": "Dalton Schultz",
      "team": "Houston Texans",
      "position": "TE",
      "status": null,
      "statistics_2024": {
        "TAR": 85,
        "REC": 53,
        "YDS": 532,
        "AVG": 10.0,
        "TD": 2,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 118.2
      },
      "projections_2025": {
        "TAR": 77,
        "REC": 51,
        "YDS": 557,
        "AVG": 10.9,
        "TD": 2,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 121.51
      },
      "outlook_2025": "Schultz is eyeing a rebound in 2025 after he followed up four consecutive top-12 fantasy campaigns with a 20th-place finish (28th in PPG) in 2024. Schultz posted a productive 59-635-5 receiving line in 15 games in 2023 (his first season in Houston), but saw his usage dip last season despite ranking fourth among tight ends in pass routes. He became a nonfactor near the goal line, totaling two end zone targets and two TDs, both of which are his fewest since taking on a regular offensive role in 2020. His history suggests a return to the fringe-TE1 mix is possible, and he could see a slight boost in targets with Christian Kirk and a pair of rookies set to replace Stefon Diggs (free agency) and Tank Dell (knee), but he also could lose work to second-year TE Cade Stover. Schultz doesn't have much late-round appeal."
    },
    {
      "rank": 218,
      "player_name": "Bryce Young",
      "team": "Carolina Panthers",
      "position": "QB",
      "status": null,
      "statistics_2024": {
        "PASS_CMP": 234,
        "PASS_ATT": 384,
        "PASS_YDS": 2403,
        "PASS_TD": 15,
        "INT": 9,
        "RUSH_CAR": 43,
        "RUSH_YDS": 249,
        "RUSH_TD": 6,
        "FPTS": 223.9
      },
      "projections_2025": {
        "PASS_CMP": 373,
        "PASS_ATT": 589,
        "PASS_YDS": 3903,
        "PASS_TD": 22,
        "INT": 13,
        "RUSH_CAR": 51,
        "RUSH_YDS": 293,
        "RUSH_TD": 4,
        "FPTS": 310.19
      },
      "outlook_2025": "Young is entering his third NFL season looking to carry over the momentum from a strong finish to 2024. After a tough rookie campaign, the 2023 No. 1 pick was briefly benched last season prior to making a big leap once back in the lineup. Young played 10 full games from Week 8 on and averaged 18.0 fantasy PPG, which would've ranked 10th over the full season. He posted a pair of top-2 fantasy weeks in his final three outings. Young threw multiple passing TDs in each of those final three games, but perhaps most notable was his leap as a rusher (30-208-5 during his final eight games after totaling 294 yards and one TD in his first 22 pro games). Young still has a lot to prove, but the 23-year-old's late-season surge, as well as the arrival of first-round WR Tetairoa McMillan, is enough to make him worth late-round consideration on draft day."
    },
    {
      "rank": 219,
      "player_name": "Geno Smith",
      "team": "Las Vegas Raiders",
      "position": "QB",
      "status": null,
      "statistics_2024": {
        "PASS_CMP": 407,
        "PASS_ATT": 578,
        "PASS_YDS": 4320,
        "PASS_TD": 21,
        "INT": 15,
        "RUSH_CAR": 53,
        "RUSH_YDS": 272,
        "RUSH_TD": 2,
        "FPTS": 306.4
      },
      "projections_2025": {
        "PASS_CMP": 400,
        "PASS_ATT": 592,
        "PASS_YDS": 4254,
        "PASS_TD": 21,
        "INT": 13,
        "RUSH_CAR": 58,
        "RUSH_YDS": 287,
        "RUSH_TD": 2,
        "FPTS": 300.33
      },
      "outlook_2025": "Smith was traded to Las Vegas during the offseason. He reunites with Pete Carroll, who was Seattle's head coach when Smith posted career-best marks in passing yards (4,282), pass TDs (30) and fantasy finish (fifth, or ninth in PPG) in 2022. Smith's output has dipped quite a bit the last two seasons (22nd in PPG in 2023 and 16th in 2024), the latter despite ranking top 5 in pass attempts, completions and yards. He has evolved into a solid, albeit conservative passer who adds some value with his legs. His supporting cast in Las Vegas won't be quite as good as in Seattle, though Brock Bowers and Jakobi Meyers provide a pair of good targets. Now 34, Smith is best viewed as a fringe QB2 with limited upside."
    },
    {
      "rank": 220,
      "player_name": "Anthony Richardson Sr.",
      "team": "Indianapolis Colts",
      "position": "QB",
      "status": null,
      "statistics_2024": {
        "PASS_CMP": 126,
        "PASS_ATT": 264,
        "PASS_YDS": 1814,
        "PASS_TD": 8,
        "INT": 12,
        "RUSH_CAR": 86,
        "RUSH_YDS": 499,
        "RUSH_TD": 6,
        "FPTS": 178.4
      },
      "projections_2025": {
        "PASS_CMP": 157,
        "PASS_ATT": 262,
        "PASS_YDS": 1816,
        "PASS_TD": 8,
        "INT": 8,
        "RUSH_CAR": 79,
        "RUSH_YDS": 428,
        "RUSH_TD": 5,
        "FPTS": 172.1
      },
      "outlook_2025": "Richardson enters his third NFL season as one of the trickiest wild cards in fantasy. On one hand, the 2023 No. 4 overall pick has a ton of upside; he ranked no lower than sixth among QBs in carries, rush yards and rush TDs last season despite playing only 10 full games, while also pacing the position in average depth of throw and yards per completion. That led to four games with 20-plus fantasy points. On the other hand, Richardson's poor passing may land him on the bench. He had fewer than 15 fantasy points in his other six outings, threw 12 INTs on the season (fourth most) and his 48% completion percentage ranked last. In total, he averaged 15.8 fantasy PPG in the 10 games, which would've ranked 15th over the full season. Richardson is no longer a lock to start with Daniel Jones in the mix, but his elite rushing ability and aggressive passing style will put him on the weekly QB1 radar when he's in the lineup."
    },
    {
      "rank": 221,
      "player_name": "Kendre Miller",
      "team": "New Orleans Saints",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 39,
        "RUSH_YDS": 148,
        "RUSH_AVG": 3.8,
        "RUSH_TD": 1,
        "REC": 5,
        "REC_YDS": 33,
        "REC_TD": 0,
        "FPTS": 29.1
      },
      "projections_2025": {
        "CAR": 75,
        "RUSH_YDS": 320,
        "RUSH_AVG": 4.3,
        "RUSH_TD": 2,
        "REC": 11,
        "REC_YDS": 75,
        "REC_TD": 0,
        "FPTS": 62.17
      },
      "outlook_2025": "Miller is entering his third NFL season having accrued only 95 touches in 14 career games. That's a big letdown for a former third-round pick, and though a variety of injuries have been a culprit, he has yet to even lock down clear backup duties to Alvin Kamara when healthy. The good news is he's young (23), capable as both a rusher and receiver and should have a fresh start under a new coaching staff led by Kellen Moore. Kamara remains the lead back in New Orleans, but he turns 30 this year, which opens to the door for Miller to be a valuable insurance back if he can fend off Clyde Edwards-Helaire and Devin Neal for No. 2 duties. Miller is a fine late-round lottery ticket."
    },
    {
      "rank": 222,
      "player_name": "Rico Dowdle",
      "team": "Carolina Panthers",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 235,
        "RUSH_YDS": 1079,
        "RUSH_AVG": 4.6,
        "RUSH_TD": 2,
        "REC": 39,
        "REC_YDS": 249,
        "REC_TD": 3,
        "FPTS": 197.8
      },
      "projections_2025": {
        "CAR": 75,
        "RUSH_YDS": 338,
        "RUSH_AVG": 4.5,
        "RUSH_TD": 2,
        "REC": 21,
        "REC_YDS": 149,
        "REC_TD": 1,
        "FPTS": 83.54
      },
      "outlook_2025": "Dowdle signed with Carolina after spending his first four seasons in Dallas. Rarely utilized during his first two years with the Cowboys, Dowdle worked his way up to a backup role in 2023 before fending off Ezekiel Elliott for lead-back duties in 2024. He appeared in 16 games and ranked in the top 20 among backs in carries, rushing yards, receptions, touches and scrimmage yards. Dowdle found the end zone only five times in Dallas' struggling offense, however, which limited him to a 24th-place finish in fantasy points per game. The 27-year-old showed well in a tough situation, but he'll enter 2025 as a clear backup to Chuba Hubbard, with rookie Trevor Etienne also a threat for work. Dowdle has some deep-league insurance appeal, though he would max out as a RB2/flex even if called on to start."
    },
    {
      "rank": 223,
      "player_name": "Raheem Mostert",
      "team": "Las Vegas Raiders",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 85,
        "RUSH_YDS": 278,
        "RUSH_AVG": 3.3,
        "RUSH_TD": 2,
        "REC": 19,
        "REC_YDS": 161,
        "REC_TD": 0,
        "FPTS": 70.9
      },
      "projections_2025": {
        "CAR": 47,
        "RUSH_YDS": 205,
        "RUSH_AVG": 4.3,
        "RUSH_TD": 1,
        "REC": 9,
        "REC_YDS": 62,
        "REC_TD": 0,
        "FPTS": 45.88
      },
      "outlook_2025": "Mostert's improbable career rolls on, as the 33-year-old signed with the Raiders during free agency. Undrafted back in 2015, Mostert was severely limited by injuries throughout most of his career, totaling 320 touches prior to reaching 200 in back-to-back seasons in Miami (2022-23). Mostert's career year came in 2023 when he scored a league-high 21 touchdowns, but he predictably crashed back to earth with two scores on 104 touches last season. Mostert cleared 12 touches and 11.8 fantasy points only once last season and heads to Las Vegas as a clear backup to rookie Ashton Jeanty. He's barely worth late-round consideration in deep leagues."
    },
    {
      "rank": 224,
      "player_name": "Adonai Mitchell",
      "team": "Indianapolis Colts",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 55,
        "REC": 23,
        "YDS": 312,
        "AVG": 13.6,
        "TD": 0,
        "CAR": 4,
        "RUSH_YDS": 6,
        "RUSH_TD": 0,
        "FPTS": 53.6
      },
      "projections_2025": {
        "TAR": 47,
        "REC": 25,
        "YDS": 355,
        "AVG": 14.1,
        "TD": 2,
        "CAR": 5,
        "RUSH_YDS": 30,
        "RUSH_TD": 0,
        "FPTS": 78.2
      },
      "outlook_2025": "Mitchell is eyeing a leap forward in his second season after he was limited to 35% of the offensive snaps as a rookie. The 2024 second-round pick found himself buried behind Michael Pittman Jr., Alec Pierce and Josh Downs for most of the season, which led to inconsistent usage and one outing with double-digit fantasy points. He was targeted often when on the field (54 targets on 193 routes), but his vertical role, coupled with poor QB play (league-high 41% off target rate), led to a position-worst 43% catch rate and zero TDs. Mitchell's second-round pedigree places him on the breakout radar, but his hands will be full overcoming the team's WR depth (all three of Pittman, Pierce and Downs are back) and ongoing QB question marks. Mitchell is no more than a late-round lottery ticket."
    },
    {
      "rank": 225,
      "player_name": "Miles Sanders",
      "team": "Dallas Cowboys",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 55,
        "RUSH_YDS": 205,
        "RUSH_AVG": 3.7,
        "RUSH_TD": 2,
        "REC": 24,
        "REC_YDS": 148,
        "REC_TD": 1,
        "FPTS": 77.3
      },
      "projections_2025": {
        "CAR": 95,
        "RUSH_YDS": 419,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 3,
        "REC": 9,
        "REC_YDS": 55,
        "REC_TD": 0,
        "FPTS": 72.07
      },
      "outlook_2025": "Sanders signed with Dallas after failing to pan out during his two seasons in Carolina. Signed to a multiyear contract prior to 2023, Sanders was handed the Panthers' lead-back gig, but lost it to Chuba Hubbard within a matter of weeks. He went on to average 8.3 touches per game and score a total of two touchdowns in 26 outings prior to putting up a 116-yard, 2-TD showing with Hubbard sidelined last season. Perhaps that proves he still has some gas left in the tank, but now 28 years old and not much of a contributor as a pass catcher, it's unlikely Sanders will find his way to the fantasy radar. He'll battle Javonte Williams and rookie Jaydon Blue for work in Dallas, and is only worth a late flier in deep leagues."
    },
    {
      "rank": 226,
      "player_name": "Jacory Croskey-Merritt",
      "team": "Washington Commanders",
      "position": "RB",
      "status": "Questionable",
      "statistics_2024": null,
      "projections_2025": {
        "CAR": 31,
        "RUSH_YDS": 127,
        "RUSH_AVG": 4.1,
        "RUSH_TD": 1,
        "REC": 4,
        "REC_YDS": 29,
        "REC_TD": 0,
        "FPTS": 27.59
      },
      "outlook_2025": "Croskey-Merritt was selected in the seventh round after spending six seasons at the collegiate level. After four seasons at Alabama State, he had his breakout season at New Mexico in 2023 prior to appearing in only one game in 2024. Croskey-Merritt's elite 2023 efficiency is notable, but he's an older developmental back. With Brian Robinson Jr. and Austin Ekeler locked in atop the depth chart, Croskey-Merritt has a tough path to fantasy relevance, but he's looked the part during offseason activities, so he's worth considering in the later rounds of deep leagues."
    },
    {
      "rank": 227,
      "player_name": "Amari Cooper",
      "team": "Free Agent",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 85,
        "REC": 44,
        "YDS": 547,
        "AVG": 12.4,
        "TD": 4,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 122.7
      },
      "projections_2025": null,
      "outlook_2025": "Cooper is a free agent. The 10-year vet came out of the gate averaging a career-high 27.5% target share (8.8 per game) with Cleveland last season, but Deshaun Watson's struggled allowed Cooper one game over 10 fantasy points. He was then traded to Buffalo and his playing time and production were all over the map (three games with 14-plus fantasy points, but fewer than 8.0 in the other six). Prior to what was essentially a lost 2024 season, Cooper had finished no better than 14th and no worse than 32nd in fantasy PPG in his first nine seasons. Now 31 years old, it's possible he has another year of fantasy relevance left in the tank, but landing spot will be key."
    },
    {
      "rank": 228,
      "player_name": "Gabe Davis",
      "team": "Free Agent",
      "position": "WR",
      "status": "Questionable",
      "statistics_2024": {
        "TAR": 42,
        "REC": 20,
        "YDS": 239,
        "AVG": 12.0,
        "TD": 2,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 53.9
      },
      "projections_2025": null,
      "outlook_2025": "Davis is entering his sixth NFL season, but remains a free agent after being released by the Jaguars. Needless to say, his lone year in Jacksonville didn't go as planned, with Davis managing just 4.2 targets per game in 10 outings. He had one big game (a two-TD effort on a season-high eight targets in Week 6), but failed to reached double-digit points in any other game. Davis has yet to finish a season better than 36th in fantasy PPG (one finish better than 51st) and that was despite four seasons in the Bills' high-scoring offense. Regardless of where he lands, the 26-year-old will remain a situational vertical threat and is unlikely to see enough work to allow anything close to weekly flex consideration."
    },
    {
      "rank": 229,
      "player_name": "Dyami Brown",
      "team": "Jacksonville Jaguars",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 40,
        "REC": 30,
        "YDS": 308,
        "AVG": 10.3,
        "TD": 1,
        "CAR": 3,
        "RUSH_YDS": 26,
        "RUSH_TD": 0,
        "FPTS": 67.4
      },
      "projections_2025": {
        "TAR": 63,
        "REC": 40,
        "YDS": 517,
        "AVG": 12.9,
        "TD": 3,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 107.56
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 230,
      "player_name": "Josh Reynolds",
      "team": "New York Jets",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 24,
        "REC": 13,
        "YDS": 194,
        "AVG": 14.9,
        "TD": 1,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 38.4
      },
      "projections_2025": {
        "TAR": 65,
        "REC": 39,
        "YDS": 496,
        "AVG": 12.6,
        "TD": 4,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 111.23
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 231,
      "player_name": "Ray-Ray McCloud III",
      "team": "Atlanta Falcons",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 87,
        "REC": 62,
        "YDS": 686,
        "AVG": 11.1,
        "TD": 1,
        "CAR": 10,
        "RUSH_YDS": 79,
        "RUSH_TD": 0,
        "FPTS": 140.5
      },
      "projections_2025": {
        "TAR": 64,
        "REC": 44,
        "YDS": 453,
        "AVG": 10.4,
        "TD": 2,
        "CAR": 9,
        "RUSH_YDS": 66,
        "RUSH_TD": 0,
        "FPTS": 108.75
      },
      "outlook_2025": "McCloud is entering his eighth NFL season, including his second in Atlanta. The 2018 sixth-round pick spent his first six seasons as a bench/situational player for four different teams prior to enjoying a mini-breakout in 2024. Operating as Atlanta's No. 3 receiver, McCloud set career-best marks in targets, catches and yardage. He was able to manage only a 59th-place finish in fantasy PPG, however, as he found the end zone once and, incredibly, now has only three touchdowns on 177 career touches. The 28-year-old remains behind Drake London and Darnell Mooney on the Atlanta depth chart. He has minimal upside and is worth a late flier only in the deepest of leagues."
    },
    {
      "rank": 232,
      "player_name": "Tutu Atwell",
      "team": "Los Angeles Rams",
      "position": "WR",
      "status": null,
      "statistics_2024": {
        "TAR": 62,
        "REC": 42,
        "YDS": 562,
        "AVG": 13.4,
        "TD": 0,
        "CAR": 2,
        "RUSH_YDS": 7,
        "RUSH_TD": 0,
        "FPTS": 98.9
      },
      "projections_2025": {
        "TAR": 63,
        "REC": 40,
        "YDS": 490,
        "AVG": 12.4,
        "TD": 2,
        "CAR": 4,
        "RUSH_YDS": 26,
        "RUSH_TD": 0,
        "FPTS": 104.82
      },
      "outlook_2025": "Atwell re-signed with the Rams during the offseason and is set to enter his fifth season with the team. The 2021 second-round pick has seen a progressive increase in receptions and yardage during each pro season, though he hasn't quite lived up to his Day 2 draft selection pedigree. Atwell has yet to post a top-60 fantasy campaign and, after failing to find the end zone in 2024, he has a total of five scores in 54 career games. Sean McVay has said that he will deploy Atwell more often moving forward, but the undersized 25-year-old remains well behind Puka Nacua and Davante Adams in terms of target priority. Atwell is not a fantasy option."
    },
    {
      "rank": 233,
      "player_name": "Calvin Austin III",
      "team": "Pittsburgh Steelers",
      "position": "WR",
      "status": "Questionable",
      "statistics_2024": {
        "TAR": 58,
        "REC": 36,
        "YDS": 548,
        "AVG": 15.2,
        "TD": 4,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 118.8
      },
      "projections_2025": {
        "TAR": 55,
        "REC": 33,
        "YDS": 427,
        "AVG": 13.1,
        "TD": 2,
        "CAR": 0,
        "RUSH_YDS": 0,
        "RUSH_TD": 0,
        "FPTS": 89.55
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 234,
      "player_name": "Christian Watson",
      "team": "Green Bay Packers",
      "position": "WR",
      "status": "Out",
      "statistics_2024": {
        "TAR": 53,
        "REC": 29,
        "YDS": 620,
        "AVG": 21.4,
        "TD": 2,
        "CAR": 4,
        "RUSH_YDS": 23,
        "RUSH_TD": 0,
        "FPTS": 105.3
      },
      "projections_2025": {
        "TAR": 25,
        "REC": 14,
        "YDS": 227,
        "AVG": 16.4,
        "TD": 2,
        "CAR": 3,
        "RUSH_YDS": 16,
        "RUSH_TD": 0,
        "FPTS": 50.17
      },
      "outlook_2025": "Watson is entering his fourth year with the Packers, but he's unlikely to return before midseason after suffering a torn ACL in Week 18 of last season. The injury is yet another setback for a player who has missed 13 regular season games, including, at least, two all three years. Even when healthy, the 2022 second-round pick has failed to live up to his pedigree, having yet to produce a top-30 fantasy campaign. He's all but settled in as a situational deep threat, ranking second in aDOT each of the last two seasons. On the plus side, Watson ranked second among receivers in YPT (11.5) and YPR (21.4) last season, which allowed a career-high 620 receiving yards. Perhaps a healthy Watson will eventually find his way back to fantasy relevance, but the 26-year-old is well off the radar in 2025."
    },
    {
      "rank": 235,
      "player_name": "Giants D/ST",
      "team": "New York Giants",
      "position": "D/ST",
      "status": null,
      "statistics_2024": {
        "SCK": 45,
        "INT": 5,
        "FR": 10,
        "TD": 2,
        "PA": 385,
        "YA": 5895,
        "FPTS": 109.3
      },
      "projections_2025": {
        "SCK": 40,
        "INT": 12,
        "FR": 11,
        "TD": 3,
        "PA": 372,
        "YA": 5780,
        "FPTS": 145.99
      },
      "outlook_2025": "The Giants have the makings of a potentially elite pass rush, having drafted DE Abdul Carter third overall to add to an already strong group including DEs Brian Burns and Kayvon Thibodeaux and DT Dexter Lawrence II. This unit should pile up sacks, but it's also in a precariously tough spot in terms of schedule, as five of its first eight games are against top-eight projected offenses, and the team has a league-low two games all season against bottom-eight offenses."
    },
    {
      "rank": 236,
      "player_name": "Buccaneers D/ST",
      "team": "Tampa Bay Buccaneers",
      "position": "D/ST",
      "status": null,
      "statistics_2024": {
        "SCK": 46,
        "INT": 7,
        "FR": 11,
        "TD": 2,
        "PA": 383,
        "YA": 5810,
        "FPTS": 114.3
      },
      "projections_2025": {
        "SCK": 43,
        "INT": 13,
        "FR": 10,
        "TD": 2,
        "PA": 368,
        "YA": 5971,
        "FPTS": 142.22
      },
      "outlook_2025": "The Buccaneers D/ST fell almost entirely into the hands of its matchups in 2024, and their 2025 should deliver more of the same. S Antoine Winfield Jr., DT Vita Vea and LB Lavonte David provide a strong core, and the addition of DE Haason Reddick can only help strengthen the defensive front. Consider the Buccaneers for in-season matchups, including their pair of divisional games against the Saints and Panthers and Week 3 against the Jets."
    },
    {
      "rank": 237,
      "player_name": "Ka'imi Fairbairn",
      "team": "Houston Texans",
      "position": "K",
      "status": null,
      "statistics_2024": {
        "FG_1_39": "19/21",
        "FG_40_49": "4/5",
        "FG_50_PLUS": "13/16",
        "FG_TOT": "36/42",
        "XP": "34/36",
        "FPTS": 166.0
      },
      "projections_2025": {
        "FG_1_39": "16/17",
        "FG_40_49": "7/9",
        "FG_50_PLUS": "5/7",
        "FG_TOT": "29/33",
        "XP": "37/38",
        "FPTS": 137.13
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 238,
      "player_name": "Joshua Karty",
      "team": "Los Angeles Rams",
      "position": "K",
      "status": null,
      "statistics_2024": {
        "FG_1_39": "19/21",
        "FG_40_49": "4/6",
        "FG_50_PLUS": "6/7",
        "FG_TOT": "29/34",
        "XP": "32/36",
        "FPTS": 130.0
      },
      "projections_2025": {
        "FG_1_39": "16/17",
        "FG_40_49": "7/9",
        "FG_50_PLUS": "5/7",
        "FG_TOT": "28/33",
        "XP": "41/43",
        "FPTS": 137.25
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 239,
      "player_name": "DJ Giddens",
      "team": "Indianapolis Colts",
      "position": "RB",
      "status": null,
      "statistics_2024": null,
      "projections_2025": {
        "CAR": 15,
        "RUSH_YDS": 63,
        "RUSH_AVG": 4.2,
        "RUSH_TD": 0,
        "REC": 5,
        "REC_YDS": 37,
        "REC_TD": 0,
        "FPTS": 19.53
      },
      "outlook_2025": "Giddens was selected by the Colts in the fifth round of April's draft. He has a solid frame and showed well at the combine, with a 4.43 40, 39.5-inch vertical (second best among RBs) and 130-inch broad (second best). He was solid efficiency-wise as a collegiate rusher but struggled with drops and may cap out as an early-down option. He'll battle Tyler Goodson for primary backup duties behind feature back Jonathan Taylor and, thus, has some late-round insurance appeal."
    },
    {
      "rank": 240,
      "player_name": "Trevor Etienne",
      "team": "Carolina Panthers",
      "position": "RB",
      "status": null,
      "statistics_2024": null,
      "projections_2025": {
        "CAR": 24,
        "RUSH_YDS": 103,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 0,
        "REC": 4,
        "REC_YDS": 30,
        "REC_TD": 0,
        "FPTS": 21.63
      },
      "outlook_2025": "Etienne was selected by Carolina in the fourth round of April's draft. Travis' brother was effective as both a rusher and receiver (3.46 YAC, 3.8 forced missed tackle rate and class-best 91% catch rate) during his three seasons at Florida and Georgia. Size (5-foot-8, 198 pounds) could limit his NFL workload ceiling, but Etienne has a three-down skill set and is one of the youngest backs in this class. He'll spend his rookie campaign developing behind lead back Chuba Hubbard and likely Rico Dowdle, and will eventually battle Hubbard and Jonathon Brooks for work in a suddenly crowded Carolina backfield. Etienne is worth rostering only in deep and dynasty leagues."
    },
    {
      "rank": 241,
      "player_name": "Jarquez Hunter",
      "team": "Los Angeles Rams",
      "position": "RB",
      "status": null,
      "statistics_2024": null,
      "projections_2025": {
        "CAR": 31,
        "RUSH_YDS": 135,
        "RUSH_AVG": 4.3,
        "RUSH_TD": 1,
        "REC": 4,
        "REC_YDS": 31,
        "REC_TD": 0,
        "FPTS": 26.79
      },
      "outlook_2025": "Hunter was selected by Rams in the fourth round of April's draft. He ranked top 4 in this class in both YAC (4.06) and forced missed tackle rate (3.2) last season and was sixth or better in both categories for his career. He didn't stand out as a receiver or at the combine, however, and could be limited to a two-down (and returner) role in the pros. Hunter will open his career behind feature back Kyren Williams and second-year Blake Corum, so he'll be worth adding in fantasy only if Williams misses time with an injury."
    },
    {
      "rank": 242,
      "player_name": "Sincere McCormick",
      "team": "Las Vegas Raiders",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 39,
        "RUSH_YDS": 183,
        "RUSH_AVG": 4.7,
        "RUSH_TD": 0,
        "REC": 6,
        "REC_YDS": 29,
        "REC_TD": 0,
        "FPTS": 27.2
      },
      "projections_2025": {
        "CAR": 24,
        "RUSH_YDS": 101,
        "RUSH_AVG": 4.2,
        "RUSH_TD": 1,
        "REC": 5,
        "REC_YDS": 31,
        "REC_TD": 0,
        "FPTS": 21.57
      },
      "outlook_2025": "McCormick is back for his fourth season with the Raiders, though his 45 career touches all came during the final few weeks of last season. Undrafted in 2022, McCormick missed his entire rookie season due to injury and spent 2023 on the practice squad. He finally got an extended look late last season and racked up 212 yards on 45 touches in four games prior to suffering a season-ending ankle injury. With first-round rookie Ashton Jeanty locked into feature-back duties, the 24-year-old McCormick is set to compete with 33-year-old Raheem Mostert for backup duties. He's not worth draft-day consideration."
    },
    {
      "rank": 243,
      "player_name": "Antonio Gibson",
      "team": "New England Patriots",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 120,
        "RUSH_YDS": 538,
        "RUSH_AVG": 4.5,
        "RUSH_TD": 1,
        "REC": 23,
        "REC_YDS": 206,
        "REC_TD": 0,
        "FPTS": 103.4
      },
      "projections_2025": {
        "CAR": 9,
        "RUSH_YDS": 40,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 0,
        "REC": 2,
        "REC_YDS": 15,
        "REC_TD": 0,
        "FPTS": 10.08
      },
      "outlook_2025": "Gibson is back for his sixth NFL season and his second in New England. He spent most of his first season with the Patriots as a change-of-pace option behind lead back Rhamondre Stevenson. He did see additional work in the final three weeks of the season, though that was a direct result of Stevenson's fumbling woes. Despite the late-season boost, Gibson cleared 12 touches in only two games and never exceeded 12.2 fantasy points in a single game. The 27-year-old has seen his fantasy PPG mark dip each season of his career and hasn't finished better than 30th in the category since 2021. There's a new, run-friendly coaching staff in New England, but Gibson is now third on the depth chart behind Stevenson and second-round rookie TreVeyon Henderson. Gibson shouldn't be drafted."
    },
    {
      "rank": 244,
      "player_name": "Jaleel McLaughlin",
      "team": "Denver Broncos",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 113,
        "RUSH_YDS": 496,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 1,
        "REC": 24,
        "REC_YDS": 76,
        "REC_TD": 2,
        "FPTS": 97.2
      },
      "projections_2025": {
        "CAR": 13,
        "RUSH_YDS": 58,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 0,
        "REC": 4,
        "REC_YDS": 27,
        "REC_TD": 0,
        "FPTS": 15.69
      },
      "outlook_2025": "McLaughlin is entering his third NFL season, having primarily played a rotational role during his first two seasons in Denver. The 2023 UDFA reached a career high with 137 touches in 2024, but he's yet to play more than 42% of the snaps in a single game. That's no surprise and unlikely to change considering his 5-foot-8, 187-pound frame. Denver did take a look at him in an expanded role during his final four games of 2024 (10-plus touches in all four, including a career-high 18 in Week 18), but he failed to reach double-digit fantasy points in any of them, nor did he clear 12.6 points in any of his 16 games last season. The 24-year-old has some juice, but he's likely to remain a depth back behind newcomers J.K. Dobbins and RJ Henry and has minimal fantasy value."
    },
    {
      "rank": 245,
      "player_name": "Devin Singletary",
      "team": "New York Giants",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 113,
        "RUSH_YDS": 437,
        "RUSH_AVG": 3.9,
        "RUSH_TD": 4,
        "REC": 21,
        "REC_YDS": 119,
        "REC_TD": 0,
        "FPTS": 96.6
      },
      "projections_2025": {
        "CAR": 17,
        "RUSH_YDS": 71,
        "RUSH_AVG": 4.2,
        "RUSH_TD": 0,
        "REC": 4,
        "REC_YDS": 26,
        "REC_TD": 0,
        "FPTS": 16.88
      },
      "outlook_2025": "Singletary is headed into his seventh NFL season, including his second with the Giants. The veteran back opened the 2024 season as New York's lead back (72% snap share and 16.5 touches per game during Weeks 1-4), but after missing the next two games, he returned to a backup role behind Tyrone Tracy Jr. From that point on, Singletary played 27% of the snaps and averaged 6.2 touches per game. The 28-year-old is a solid player with three 215-plus touch seasons under his belt (2021-23), but he's going to have a hard time seeing the field behind Tracy and rookie Cam Skattebo in 2025. He can be ignored on draft day."
    },
    {
      "rank": 246,
      "player_name": "Samaje Perine",
      "team": "Cincinnati Bengals",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 20,
        "RUSH_YDS": 92,
        "RUSH_AVG": 4.6,
        "RUSH_TD": 1,
        "REC": 28,
        "REC_YDS": 322,
        "REC_TD": 1,
        "FPTS": 81.4
      },
      "projections_2025": {
        "CAR": 46,
        "RUSH_YDS": 197,
        "RUSH_AVG": 4.2,
        "RUSH_TD": 1,
        "REC": 17,
        "REC_YDS": 137,
        "REC_TD": 1,
        "FPTS": 62.66
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 247,
      "player_name": "Ty Johnson",
      "team": "Buffalo Bills",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 41,
        "RUSH_YDS": 213,
        "RUSH_AVG": 5.2,
        "RUSH_TD": 1,
        "REC": 18,
        "REC_YDS": 284,
        "REC_TD": 3,
        "FPTS": 91.7
      },
      "projections_2025": {
        "CAR": 34,
        "RUSH_YDS": 149,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 1,
        "REC": 14,
        "REC_YDS": 138,
        "REC_TD": 1,
        "FPTS": 54.53
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 248,
      "player_name": "Elijah Mitchell",
      "team": "Kansas City Chiefs",
      "position": "RB",
      "status": null,
      "statistics_2024": null,
      "projections_2025": {
        "CAR": 50,
        "RUSH_YDS": 215,
        "RUSH_AVG": 4.3,
        "RUSH_TD": 2,
        "REC": 9,
        "REC_YDS": 62,
        "REC_TD": 0,
        "FPTS": 49.07
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 249,
      "player_name": "Kenneth Gainwell",
      "team": "Pittsburgh Steelers",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 75,
        "RUSH_YDS": 290,
        "RUSH_AVG": 3.9,
        "RUSH_TD": 1,
        "REC": 16,
        "REC_YDS": 116,
        "REC_TD": 0,
        "FPTS": 62.6
      },
      "projections_2025": {
        "CAR": 37,
        "RUSH_YDS": 154,
        "RUSH_AVG": 4.2,
        "RUSH_TD": 1,
        "REC": 12,
        "REC_YDS": 87,
        "REC_TD": 0,
        "FPTS": 47.1
      },
      "outlook_2025": "No outlook available."
    },
    {
      "rank": 250,
      "player_name": "Clyde Edwards-Helaire",
      "team": "New Orleans Saints",
      "position": "RB",
      "status": null,
      "statistics_2024": {
        "CAR": 13,
        "RUSH_YDS": 46,
        "RUSH_AVG": 3.5,
        "RUSH_TD": 0,
        "REC": 3,
        "REC_YDS": 24,
        "REC_TD": 0,
        "FPTS": 10.0
      },
      "projections_2025": {
        "CAR": 54,
        "RUSH_YDS": 237,
        "RUSH_AVG": 4.4,
        "RUSH_TD": 1,
        "REC": 6,
        "REC_YDS": 48,
        "REC_TD": 0,
        "FPTS": 43.89
      },
      "outlook_2025": "No outlook available."
    }
  


]
